tritran-123/STM32F405xx-07xx-low-layer-peripheral-drivers/STM32F407VG_MY_LIB/SRC/stm32f407vg_i2c_driver.c
#include "stm32f407vg_i2c_driver.h"

/*prototype static func in Func I2C_MasterSendData() */
static void I2C_GenerateStartCondition(RegDef_I2Cx_t *pI2Cx);
static void I2C_ExecuteAddressPhaseWrite(RegDef_I2Cx_t *pI2Cx, uint8_t SlaveAddrPhaseWrite);
static void I2C_ClearAddrFlag(I2C_Handle_t *pI2CxHandle);
static void I2C_GenerateStopCondition(RegDef_I2Cx_t *pI2Cx);
static void I2C_ManageAcking(RegDef_I2Cx_t *pI2Cx, uint8_t EnOrDis);
/*static func handle interrupt transmit and receive process */
static void I2C_MasterSendData_Interrupt_Handling(I2C_Handle_t *pI2CxHandle);
static void I2C_MasterReceive_Interrupt_Handling(I2C_Handle_t *pI2CxHandle);
/***************** static func***************/
static void I2C_GenerateStartCondition(RegDef_I2Cx_t *pI2Cx)
{
    /* START: Start generation */
    pI2Cx->CR1 |= (Enable << I2C_CR1_START);
    /* check SB: Start bit (Master mode) */
    while (!I2C_GetFlagStatus(pI2Cx, I2C_SR1_SB, I2C_Check_Flag_SR1))
        ;
}

static void I2C_ExecuteAddressPhaseWrite(RegDef_I2Cx_t *pI2Cx, uint8_t SlaveAddrPhaseWrite)
{
    /* 7 bit address and 1 bit0 direction write data in position 0  */
    SlaveAddrPhaseWrite = SlaveAddrPhaseWrite << 1;
    SlaveAddrPhaseWrite &= ~(1U << 0);
    pI2Cx->DR = SlaveAddrPhaseWrite;
    /* checking  ADDR: Address sent (master mode)/matched (slave mode) 1: Received address matched.*/
    while (!I2C_GetFlagStatus(pI2Cx, I2C_SR1_ADDR, I2C_Check_Flag_SR1))
        ;
}

static void I2C_ClearAddrFlag(I2C_Handle_t *pI2CxHandle)
{
    uint32_t dummy_read;
    /* Check master mode */
    if (I2C_GetFlagStatus(pI2CxHandle->pI2Cx, I2C_SR2_MSL, I2C_Check_Flag_SR2)) /* Bit 0 MSL: Master/slave   1: Master Mode*/
    {
        /* Disable Ack -*/
        // pI2CxHandle->pI2Cx->CR1 &= ~(1U << I2C_CR1_ACK); /*  0: No acknowledge returned */
        /* Read SR1 and SR2 */
        dummy_read = pI2CxHandle->pI2Cx->SR1;
        dummy_read = pI2CxHandle->pI2Cx->SR2;
        (void)dummy_read;
    }
    else
    {
        /* slave mode,similar read data */
    }
}

static void I2C_GenerateStopCondition(RegDef_I2Cx_t *pI2Cx)
{
    /*  condition to determine stop- wait TxE empty(already tranfer all data) and Bit 2 BTF: Byte transfer finished */
    while (!I2C_GetFlagStatus(pI2Cx, I2C_SR1_BTF, I2C_Check_Flag_SR1))
        ; /* 1: Data byte transfer succeeded, clear by hardware after a start or a stop condition*/
    /* generate STOP: Stop generation  1: Stop generation after the current byte transfer or after the current Start condition is sent.*/
    pI2Cx->CR1 |= (Enable << I2C_CR1_STOP);
}

static void I2C_ManageAcking(RegDef_I2Cx_t *pI2Cx, uint8_t EnOrDis)
{
    if (EnOrDis == Enable)
    {
        pI2Cx->CR1 |= (Enable << I2C_CR1_ACK);
    }
    else
    {
        pI2Cx->CR1 &= ~(1U << I2C_CR1_ACK);
    }
}

static void I2C_ExecuteAddressPhaseRead(RegDef_I2Cx_t *pI2Cx, uint8_t SlaveAddrPhaseRead)
{
    /* 7 bit address and 1 bit1 direction read data in position 0  */
    SlaveAddrPhaseRead = SlaveAddrPhaseRead << 1;
    SlaveAddrPhaseRead |= (1U << 0); /* bit 0 in buffer addr 8bit = 1 is master read data*/
    pI2Cx->DR = SlaveAddrPhaseRead;
    /* checking  ADDR: Address sent (master mode)/matched (slave mode) 1: Received address matched.*/
    while (!I2C_GetFlagStatus(pI2Cx, I2C_SR1_ADDR, I2C_Check_Flag_SR1))
        ;
}

static void I2C_MasterSendData_Interrupt_Handling(I2C_Handle_t *pI2CxHandle)
{
    /* check device is master mode */
    if (I2C_GetFlagStatus(pI2CxHandle->pI2Cx, I2C_SR2_MSL, I2C_Check_Flag_SR2))
    {
        /*check status of flag TxE -> alway set( empty reg DR ) and Txlen > 0 (have data to tranfer)*/
        if ((I2C_GetFlagStatus(pI2CxHandle->pI2Cx, I2C_SR1_TxE, I2C_Check_Flag_SR1)) && (pI2CxHandle->Txlen > 0))
        {
            /* similar send data polling */
            pI2CxHandle->pI2Cx->DR = *(pI2CxHandle->TxBuffer); /* assign value into reg */
            pI2CxHandle->Txlen -= 1;                        /* Decrease lenght string tranfer */
            pI2CxHandle->TxBuffer += 1;                     /* point to next element to continue tranfer*/
        }
    }
}

static void I2C_MasterReceiveData_Interrupt_Handling(I2C_Handle_t *pI2CxHandle)
{
    /* Similar Receive data polling */
    /* 2 case (receive 1 byte or >1byte) */
    /*if just send 1 byte -> disable Ack -> slave receive Non-Ack signal to stop transmit data */
    if (pI2CxHandle->Rxlen == 1)
    {
        /* Disable Ack-> after receive data in shift register, master send non-Ack pulse to slave to stop communicate */
        I2C_ManageAcking(pI2CxHandle->pI2Cx, Disable);
        /* read data in DR and take it to Rxbuffer (case : 1byte ) and decrease 1unit Rxlen */
        *(pI2CxHandle->RxBuffer) = pI2CxHandle->pI2Cx->DR;
        pI2CxHandle->Rxlen--;
    }
    else /* Data master receive > 1byte */
    {
        /* receive data and check if it 2nd last data8byte, Disable Ack-> after receive data in shift register (last data),2nd last data in DR ,
        master send non-Ack pulse to slave to stop communicate*/
        if (pI2CxHandle->Rxlen == 2) /* Disable nonAck if 2nd last data already in shift register , master will send nonAck pulse in last data to slave */
        {
            I2C_ManageAcking(pI2CxHandle->pI2Cx, Disable);
        }
        /* read data in DR and take it to Rxbuffer  */
        *(pI2CxHandle->RxBuffer) = pI2CxHandle->pI2Cx->DR;
        pI2CxHandle->RxBuffer += 1;
        pI2CxHandle->Rxlen--;
    }

    /* check lengt data Rxbuffer already receive full data ? */
    if (pI2CxHandle->Rxlen == 0)
    {
        /* Generated stop condition */
        if (pI2CxHandle->CircuitData == I2C_ContinuesCircuitData_Disable) /* user don't want to continues tranfer new frame*/
        {
            I2C_GenerateStopCondition(pI2CxHandle->pI2Cx);
        }
        /* already done in receive -> assign value in struct to 0 and Null */
        I2C_CloseReception(pI2CxHandle);
        /*Call applicationevent to notice user already done in interrupt with Event Tx_CMPLT */
        I2C_ApplicationEventCallBack(pI2CxHandle, I2C_EVENT_RX_CMPLT);
    }
}

/*****************************************main func init module I2C*********************************8*/
void I2C_PeripheralClockControl(RegDef_I2Cx_t *pI2Cx, uint8_t EnOrDis)
{
    if (EnOrDis == Enable)
    {
        if (pI2Cx == I2C1)
        {
            I2C1_Enable_Clock();
        }
        else if (pI2Cx == I2C2)
        {
            I2C2_Enable_Clock();
        }
        else if (pI2Cx == I2C3)
        {
            I2C3_Enable_Clock();
        }
    }
    else if (EnOrDis == Disable)
    {
        if (pI2Cx == I2C1)
        {
            I2C1_Disable_Clock();
        }
        else if (pI2Cx == I2C2)
        {
            I2C2_Disable_Clock();
        }
        else if (pI2Cx == I2C3)
        {
            I2C3_Disable_Clock();
        }
    }
}

