tritran-123/STM32F405xx-07xx-low-layer-peripheral-drivers/STM32F407VG_MY_LIB/SRC/stm32f407vg_i2c_driver.c
void I2C_Initialize(I2C_Handle_t *pI2CxHandle)
{
    /* enable clock in module i2c chanel x */
    I2C_PeripheralClockControl(pI2CxHandle->pI2Cx, Enable);
    /* Declare variable temp to assign each bit field's value (total 15/32bit) in register */
    uint32_t tempreg = 0;
    /* Set ACK in CR1 */
    tempreg |= (pI2CxHandle->I2C_Config.I2C_AckControl << I2C_CR1_ACK);
    /* assign all value in CR1 */
    pI2CxHandle->pI2Cx->CR1 = tempreg;

    /* Set FREQ[5:0] in CR2 */
    tempreg = 0;
    /* In default MCU used main clock is HSI = 16MHz in 2 Bus APB1 APB2 = 16MHz*/
    /* if use funtion SYS_Config_Clock_Tree() to set max clock in each Bus (APB1 = 42MHz) */
    uint32_t DetermineSWS = RCC->CFGR; /*Bits 3:2 SWS: System clock switch status determine main system clock is HSI or PLL */
    uint32_t APBClock = 0;
    if ((DetermineSWS >> 2) & 0x3)
    {
        /* SYS clock is PLL 10: PLL used as the system clock */
        APBClock = 42000000; /* 42Mhz */
    }
    else
    {
        APBClock = 16000000; /*default use HSI clock */
    }
    tempreg |= ((APBClock / 1000000U) << I2C_CR2_FREQ);
    /* assign all value in CR2 */
    pI2CxHandle->pI2Cx->CR2 = (tempreg & 0x3F); /* take 6bit in CR2 FREQ[5:0]: Peripheral clock frequency */

    /* set total address bit in OAR1 - default =  0: 7-bit determine device address */
    tempreg = 0;
    tempreg |= (pI2CxHandle->I2C_Config.I2C_DeviceAddress << I2C_OAR1_ADD7_1);
    tempreg |= (Enable << 14); /*  Bit 14 Should always be kept at 1 by software.*/
    /* assign all value in OAR1 */
    pI2CxHandle->pI2Cx->OAR1 = tempreg;

    /* Set CCR in I2C Clock control register (I2C_CCR) */
    tempreg = 0;
    /* Tlow + Thigh = 1/f(mode) - RM page 870 to determine CCR in 2 mode  */
    uint16_t CCRValue = 0; /*  CCR[11:0]: Clock control register in Fm/Sm mode (Master mode)  */
    if (pI2CxHandle->I2C_Config.I2C_SCLSPEED <= I2C_SCLSPEED_SM)
    {
        /* Standard mode */
        CCRValue = (APBClock) / (2 * (pI2CxHandle->I2C_Config.I2C_SCLSPEED));
        tempreg |= ((CCRValue & 0xFFF) << I2C_CCR_CCR); /* take 12 bit in value and assign into register */
    }
    else
    {
        /* Fast mode */
        tempreg |= (Enable << I2C_CCR_F_S);
        if (pI2CxHandle->I2C_Config.I2C_FMDutyCycle == I2C_FMDutyCycle_2)
        {
            /* 0: Fm mode tlow/thigh = 2 */
            CCRValue = (APBClock) / (3 * (pI2CxHandle->I2C_Config.I2C_SCLSPEED));
        }
        else
        {
            /* 1: Fm mode tlow/thigh = 16/9 (see CCR) */
            CCRValue = (APBClock) / (25 * (pI2CxHandle->I2C_Config.I2C_SCLSPEED));
            tempreg |= (Enable << I2C_CCR_DUTY);
        }
        tempreg |= ((CCRValue & 0xFFF) << I2C_CCR_CCR); /* take 12 bit in value and assign into register */
    }
    /* assign all value in I2C Clock control register (I2C_CCR) */
    pI2CxHandle->pI2Cx->CCR = tempreg;

    /* Set TRISE (Time rise in Fm/Sm mode (Master mode)) config available rising edge */
    tempreg = 0;
    /* RM page 871 to determine value TRISE in 2 mode */
    /* TRISE_VAlue = (maximum_Time_rise)/(T_PeripheralClock) + 1 (same unit 1Mhz = 10^6 Hz ,1s = 10^9 ns) */
    if (pI2CxHandle->I2C_Config.I2C_SCLSPEED <= I2C_SCLSPEED_SM)
    {
        /* 0: Sm mode  */
        /* For Standard Mode (Sm), the maximum allowed SCL rise time is typically 1000 ns. */
        tempreg |= ((APBClock / 1000000U) + 1);
    }
    else
    {
        /* 1: Fm mode  */
        /* the Maximum allowed SCL rise time is 300 ns. */
        tempreg |= (((APBClock * 300) / 1000000000U) + 1);
    }
    pI2CxHandle->pI2Cx->TRISE = (tempreg & 0x3F); /* take 6bit and assign into TRISE[5:0]*/
}

void I2C_PeripheralControl(RegDef_I2Cx_t *pI2Cx, uint8_t EnOrDis)
{
    if (EnOrDis == Enable)
    {
        pI2Cx->CR1 |= (Enable << I2C_CR1_PE);
    }
    else
    {
        pI2Cx->CR1 &= ~(1U << I2C_CR1_PE);
    }
}

uint8_t I2C_GetFlagStatus(RegDef_I2Cx_t *pI2Cx, uint32_t FlagName, uint8_t WhatSRReg)
{
    FlagName = (Set << FlagName);
    if (WhatSRReg == I2C_Check_Flag_SR1)
    {
        if (pI2Cx->SR1 & (FlagName))
        {
            return FLAG_ALREADY_SET;
        }
        return FLAG_ALREADY_RESET;
    }
    else if (WhatSRReg == I2C_Check_Flag_SR2)
    {
        if (pI2Cx->SR2 & (FlagName))
        {
            return FLAG_ALREADY_SET;
        }
        return FLAG_ALREADY_RESET;
    }
}

void I2C_MasterSendData(I2C_Handle_t *pI2CxHandle, uint8_t *TxBuffer, uint32_t Len, uint8_t SlaveAddr, uint8_t CircuitData)
{
    /* generate START condition and checking SB flag in SR1 */
    I2C_GenerateStartCondition(pI2CxHandle->pI2Cx);
    /* Send Slave Addr and checking  ADDR: Address sent (master mode)/matched (slave mode) in CR1 */
    I2C_ExecuteAddressPhaseWrite(pI2CxHandle->pI2Cx, SlaveAddr);
    /*  EV6: ADDR=1, cleared by reading SR1 register followed by reading SR2. */
    I2C_ClearAddrFlag(pI2CxHandle);

    /* Send data */
    while (Len > 0)
    {
        /* wait TxE empty to write data into DR reg */
        while (!I2C_GetFlagStatus(pI2CxHandle->pI2Cx, I2C_SR1_TxE, I2C_Check_Flag_SR1))
            ;
        /* write data */
        pI2CxHandle->pI2Cx->DR = *(TxBuffer); /* assign value into reg */
        Len -= 1;                             /* Decrease lenght string tranfer */
        TxBuffer += 1;                        /* point to next element to continue tranfer*/
    }

    /* When tranfer all data -> len = 0 (TxE set )wait flag  Bit 2 BTF: Byte transfer finished in SR1 to qualify generate stop condition */
    while (!I2C_GetFlagStatus(pI2CxHandle->pI2Cx, I2C_SR1_TxE, I2C_Check_Flag_SR1))
        ;                                                /*  1: Data register empty */
    if (CircuitData == I2C_ContinuesCircuitData_Disable) /* user don't want continues tranfer new frame */
    {
        I2C_GenerateStopCondition(pI2CxHandle->pI2Cx);
    }
}

