tritran-123/STM32F405xx-07xx-low-layer-peripheral-drivers/STM32F407VG_MY_LIB/SRC/stm32f407vg_i2c_driver.c
void I2C_MasterReceiveData(I2C_Handle_t *pI2CxHandle, uint8_t *RxBuffer, uint32_t Len, uint8_t SlaveAddr, uint8_t CircuitData)
{
    /* generate START condition and checking SB flag in SR1 */
    I2C_GenerateStartCondition(pI2CxHandle->pI2Cx);
    /* Send Slave Addr and checking  ADDR: Address sent (master mode)/matched (slave mode) in CR1 */
    I2C_ExecuteAddressPhaseRead(pI2CxHandle->pI2Cx, SlaveAddr);

    /*if just send 1 byte -> disable Ack -> slave receive Non-Ack signal to stop transmit data */
    if (Len == 1)
    {
        /* Disable Ack-> after receive data in shift register, master send non-Ack pulse to slave to stop communicate */
        I2C_ManageAcking(pI2CxHandle->pI2Cx, Disable);
        /* Clear Addr flag in SR1 */
        I2C_ClearAddrFlag(pI2CxHandle);
        /* Wait flag Rxne set to determine data already in DR reg and make stop condition */
        while (!I2C_GetFlagStatus(pI2CxHandle->pI2Cx, I2C_SR1_RxNE, I2C_Check_Flag_SR1))
            ;                                                /*  1: Data register not empty */
        if (CircuitData == I2C_ContinuesCircuitData_Disable) /* user don't want continues tranfer new frame */
        {
            I2C_GenerateStopCondition(pI2CxHandle->pI2Cx);
        }
        /* read data in DR and take it to Rxbuffer (case : 1byte ) */
        *RxBuffer = pI2CxHandle->pI2Cx->DR;
    }
    else /* Data master receive > 1byte */
    {
        /* Clear Addr flag in SR1 */
        I2C_ClearAddrFlag(pI2CxHandle);
        /* receive data and check if it 2nd last data8byte, Disable Ack-> after receive data in shift register (last data),2nd last data in DR ,
        master send non-Ack pulse to slave to stop communicate*/
        for (uint32_t i = Len; i > 0; i--)
        {
            if (i == 2) /* Disable nonAck if 2nd last data already in shift register , master will send nonAck pulse in last data to slave */
            {
                I2C_ManageAcking(pI2CxHandle->pI2Cx, Disable);
            }
            /* read data in DR and take it to Rxbuffer  */
            *RxBuffer = pI2CxHandle->pI2Cx->DR;
            RxBuffer += 1;
            /* Wait flag Rxne set to determine data already in DR reg and make stop condition */
            while (!I2C_GetFlagStatus(pI2CxHandle->pI2Cx, I2C_SR1_RxNE, I2C_Check_Flag_SR1))
                ;                                                /*  1: Data register not empty */
            if (CircuitData == I2C_ContinuesCircuitData_Disable) /* user don't want continues tranfer new frame */
            {
                I2C_GenerateStopCondition(pI2CxHandle->pI2Cx);
            }
        }
    }
    /* Enable Acking after communicate */
    if (pI2CxHandle->I2C_Config.I2C_AckControl == I2C_AckControl_Enable)
    {
        I2C_ManageAcking(pI2CxHandle->pI2Cx, Enable);
    }
}

uint8_t I2C_MasterSendDataInterruptInit(I2C_Handle_t *pI2CxHandle, uint8_t *TxBuffer, uint32_t Len, uint8_t SlaveAddr, uint8_t CircuitData)
{
    uint8_t state = pI2CxHandle->TxRxState;
    if ((state != I2C_BUSY_IN_TX) && (state != I2C_BUSY_IN_RX)) /* first init doesnt determine TxRxState */
    {
        /* Similar init assign address data like SPI module interrupt ,maybe = 0 ready*/
        pI2CxHandle->TxBuffer = TxBuffer;
        pI2CxHandle->Txlen = Len;
        pI2CxHandle->TxRxState = I2C_BUSY_IN_TX;
        pI2CxHandle->CircuitData = CircuitData;
        pI2CxHandle->SlaveAdress = SlaveAddr;
        /* Start Condition */
        I2C_GenerateStartCondition(pI2CxHandle->pI2Cx);
        /* Enable control bit to make start and another sources interrupt
        (Enable bit  ITEVFEN and ITBUFEN in CR2 ) */
        pI2CxHandle->pI2Cx->CR2 |= (Enable << I2C_CR2_ITEVTEN); /* 1: Event interrupt enabled*/
        pI2CxHandle->pI2Cx->CR2 |= (Enable << I2C_CR2_ITBUFEN); /* 1: TxE = 1 or RxNE = 1 generates Event Interrupt (whatever the state of DMAEN)*/
        pI2CxHandle->pI2Cx->CR2 |= (Enable << I2C_CR2_ITERREN); /*  1: Error interrupt enabled*/
        /* pI2CxHandle->pI2Cx->CR2 |= (0x7 << I2C_CR2_ITERREN); /* Enable bit 8-9-10  */
    }
    return state;
}

uint8_t I2C_MasterReceiveDataInterruptInit(I2C_Handle_t *pI2CxHandle, uint8_t *RxBuffer, uint32_t Len, uint8_t SlaveAddr, uint8_t CircuitData)
{
    uint8_t state = pI2CxHandle->TxRxState; /* first init doesnt determine TxRxState, maybe = 0 ready */
    if ((state != I2C_BUSY_IN_TX) && (state != I2C_BUSY_IN_RX))
    {
        /* Similar init assign address data like SPI module interrupt */
        pI2CxHandle->RxBuffer = RxBuffer;
        pI2CxHandle->Rxlen = Len;
        pI2CxHandle->TxRxState = I2C_BUSY_IN_RX;
        pI2CxHandle->CircuitData = CircuitData;
        pI2CxHandle->SlaveAdress = SlaveAddr;
        /* Start Condition */
        I2C_GenerateStartCondition(pI2CxHandle->pI2Cx);
        /* Enable control bit to make start and another sources interrupt
        (Enable bit  ITEVFEN and ITBUFEN in CR2 ) */
        pI2CxHandle->pI2Cx->CR2 |= (Enable << I2C_CR2_ITEVTEN); /* 1: Event interrupt enabled*/
        pI2CxHandle->pI2Cx->CR2 |= (Enable << I2C_CR2_ITBUFEN); /* 1: TxE = 1 or RxNE = 1 generates Event Interrupt (whatever the state of DMAEN)*/
        pI2CxHandle->pI2Cx->CR2 |= (Enable << I2C_CR2_ITERREN); /*  1: Error interrupt enabled*/
        /* pI2CxHandle->pI2Cx->CR2 |= (0x7 << I2C_CR2_ITERREN); /* Enable bit 8-9-10  */
    }
    return state;
}

void I2C_IRQEventHandling(I2C_Handle_t *pI2CHandle)
{
    /* Declare 3 temp variable to read bits, determine source interrupt */
    uint32_t temp1 = 0, temp2 = 0, temp3 = 0;
    /* Determine control bit to make event interrupt already enable ? */
    /* Read bit ITEVTEN in CR2 */
    temp1 = pI2CHandle->pI2Cx->CR2 & (Set << I2C_CR2_ITEVTEN);
    /* Read bit ITBUFEN in CR2 */
    temp2 = pI2CHandle->pI2Cx->CR2 & (Set << I2C_CR2_ITBUFEN);
    /* Read flag SB */
    temp3 = I2C_GetFlagStatus(pI2CHandle->pI2Cx, I2C_SR1_SB, I2C_Check_Flag_SR1);

    /*-----------------------------------------------------------------------------------------------------------------*/
    /* Interrupt make by Start bit (Flag = SB ,  Enable control bit = ITEVFEN )*/
    if (temp1 && temp3)
    {
        if (pI2CHandle->TxRxState == I2C_BUSY_IN_TX)
        {
            I2C_ExecuteAddressPhaseWrite(pI2CHandle->pI2Cx, pI2CHandle->SlaveAdress);
        }
        else if (pI2CHandle->TxRxState == I2C_BUSY_IN_RX)
        {
            I2C_ExecuteAddressPhaseRead(pI2CHandle->pI2Cx, pI2CHandle->SlaveAdress);
        }
    }

    /*-----------------------------------------------------------------------------------------------------------------*/

    /* Interrupt make by ADDR (Flag = ADDR ,  Enable control bit = ITEVFEN )*/
    temp3 = I2C_GetFlagStatus(pI2CHandle->pI2Cx, I2C_SR1_ADDR, I2C_Check_Flag_SR1);
    if (temp1 && temp3)
    {
        I2C_ClearAddrFlag(pI2CHandle);
    }

    /* Interrupt make by Data byte transfer finished (flag = BTF , Enable control bit = ITEVFEN)*/
    temp3 = I2C_GetFlagStatus(pI2CHandle->pI2Cx, I2C_SR1_BTF, I2C_Check_Flag_SR1);
    if (temp1 && temp3)
    {
        if (pI2CHandle->TxRxState == I2C_BUSY_IN_TX)
        {
            /* check bit TxE already set (empty reg data -> transmit full data )*/
            if ((I2C_GetFlagStatus(pI2CHandle->pI2Cx, I2C_SR1_TxE, I2C_Check_Flag_SR1)) && (pI2CHandle->Txlen == 0))
            {
                /* Generated stop condition */
                if (pI2CHandle->CircuitData == I2C_ContinuesCircuitData_Disable) /* user don't want to continues tranfer new frame*/
                {
                    I2C_GenerateStopCondition(pI2CHandle->pI2Cx);
                }
                /* already done in tranfer -> assign value in struct to 0 and Null */
                I2C_CloseTranmission(pI2CHandle);
                /*Call applicationevent to notice user already done in interrupt with Event Tx_CMPLT */
                I2C_ApplicationEventCallBack(pI2CHandle, I2C_EVENT_TX_CMPLT);
            }
        }
        else if (pI2CHandle->TxRxState == I2C_BUSY_IN_RX)
        {
            /* TODO */

            /* check lengt data Rxbuffer already receive full data ? */
            if (pI2CHandle->Rxlen == 0)
            {
                /* Generated stop condition */
                if (pI2CHandle->CircuitData == I2C_ContinuesCircuitData_Disable) /* user don't want to continues tranfer new frame*/
                {
                    I2C_GenerateStopCondition(pI2CHandle->pI2Cx);
                }
                /* already done in receive -> assign value in struct to 0 and Null */
                I2C_CloseReception(pI2CHandle);
                /*Call applicationevent to notice user already done in interrupt with Event Tx_CMPLT */
                I2C_ApplicationEventCallBack(pI2CHandle, I2C_EVENT_RX_CMPLT);
            }
        }
    }

    /*-----------------------------------------------------------------------------------------------------------------*/

    /* Interrupt make by  Stop received (Slave) (flag = STOPF , Enable control bit = ITEVFEN)*/
    /*  Set by hardware when a Stop condition is detected on the bus by the slave after an
acknowledge (if ACK=1)*/
    temp3 = I2C_GetFlagStatus(pI2CHandle->pI2Cx, I2C_SR1_STOPF, I2C_Check_Flag_SR1);
    if (temp1 && temp3)
    {
        /*  Cleared by software reading the SR1 register followed by a write in the CR1 register, */
        pI2CHandle->pI2Cx->CR1 |= 0x0000; /* clear STOPF */
        /*Call applicationevent to notice user already done in interrupt with Event STOPF */
        I2C_ApplicationEventCallBack(pI2CHandle, I2C_EVENT_STOPF);
    }

    /*-----------------------------------------------------------------------------------------------------------------*/

    /*****Interrupt make by   Transmit buffer empty (flag = TxE , Enable control bit = ITEVFEN + ITBUFEN)***/
    temp3 = I2C_GetFlagStatus(pI2CHandle->pI2Cx, I2C_SR1_TxE, I2C_Check_Flag_SR1);
    if (temp1 && temp2 && temp3)
    {
        /* call static func to handle tranfer process */
        I2C_MasterSendData_Interrupt_Handling(pI2CHandle);
    }

    /*-----------------------------------------------------------------------------------------------------------------*/

    /*****Interrupt make by  Receive buffer not empty (flag = RxNE , Enable control bit = ITEVFEN + ITBUFEN)***/
    temp3 = I2C_GetFlagStatus(pI2CHandle->pI2Cx, I2C_SR1_RxNE, I2C_Check_Flag_SR1);
    if (temp1 && temp2 && temp3)
    {
        /* call static func to handle reception process */
        I2C_MasterReceiveData_Interrupt_Handling(pI2CHandle);
    }
}

void I2C_CloseTranmission(I2C_Handle_t *pI2CxHandle)
{
    /* Disable control bit make interrupt */
    pI2CxHandle->pI2Cx->CR2 &= ~(1U << I2C_CR2_ITEVTEN); /* 0: Event interrupt Disabled*/
    pI2CxHandle->pI2Cx->CR2 &= ~(1U << I2C_CR2_ITBUFEN); /* 0: TxE = 1 or RxNE = 1 not generates Event Interrupt (whatever the state of DMAEN)*/
    /* assign value in struct back to new */
    pI2CxHandle->TxBuffer = NULL;
    pI2CxHandle->Txlen = 0;
    pI2CxHandle->TxRxState = I2C_READY;
}

