tritran-123/STM32F405xx-07xx-low-layer-peripheral-drivers/STM32F407VG_MY_LIB/SRC/stm32f407vg_i2c_driver.c
void I2C_CloseReception(I2C_Handle_t *pI2CxHandle)
{
    /* Disable control bit make interrupt */
    pI2CxHandle->pI2Cx->CR2 &= ~(1U << I2C_CR2_ITEVTEN); /* 0: Event interrupt Disabled*/
    pI2CxHandle->pI2Cx->CR2 &= ~(1U << I2C_CR2_ITBUFEN); /* 0: TxE = 1 or RxNE = 1 not generates Event Interrupt (whatever the state of DMAEN)*/
    /* assign value in struct back to new */
    pI2CxHandle->RxBuffer = NULL;
    pI2CxHandle->Rxlen = 0;
    pI2CxHandle->TxRxState = I2C_READY;

    /* Enable Acking after communicate */
    if (pI2CxHandle->I2C_Config.I2C_AckControl == I2C_AckControl_Enable)
    {
        I2C_ManageAcking(pI2CxHandle->pI2Cx, Enable);
    }
}

void I2C_IRQErrorHandling(I2C_Handle_t *pI2CHandle)
{
    /* Declare 3 temp variable to read bits, determine source interrupt in error */
    uint32_t temp1 = 0, temp2 = 0;
    /* Determine control bit to make error interrupt already enable ? */
    /* Read bit  ITERREN in CR2 */
    temp1 = pI2CHandle->pI2Cx->CR2 & (Set << I2C_CR2_ITERREN);

    /*-----------------------------------------------------------------------------------------------------------------*/
    /* Interrupt make by Bus error (Flag =  BERR ,  Enable control bit = ITERREN )*/
    temp2 = I2C_GetFlagStatus(pI2CHandle->pI2Cx, I2C_SR1_BERR, I2C_Check_Flag_SR1);
    if (temp1 && temp2)
    {
        /*  Set by hardware when the interface detects an SDA rising or falling edge while SCL is high,
occurring in a non-valid position during a byte transfer.*/
        /*  Cleared by software writing 0, or by hardware when PE=0 */
        pI2CHandle->pI2Cx->SR1 &= ~(1U << I2C_SR1_BERR);
        /*Call applicationevent to notice user already done in interrupt with I2C_EVENT_BERR */
        I2C_ApplicationEventCallBack(pI2CHandle, I2C_EVENT_BERR);
    }

    /*-----------------------------------------------------------------------------------------------------------------*/
    /* Interrupt make by  ARLO: Arbitration lost (master mode)  (Flag =  ARLO ,  Enable control bit = ITERREN )*/
    temp2 = I2C_GetFlagStatus(pI2CHandle->pI2Cx, I2C_SR1_ARLO, I2C_Check_Flag_SR1);
    if (temp1 && temp2)
    {
        /* Set by hardware when the interface loses the arbitration of the bus to another master*/
        /*  Cleared by software writing 0, or by hardware when PE=0 */
        pI2CHandle->pI2Cx->SR1 &= ~(1U << I2C_SR1_ARLO);
        /*Call applicationevent to notice user already done in interrupt with I2C_EVENT_ARLO */
        I2C_ApplicationEventCallBack(pI2CHandle, I2C_EVENT_ARLO);
    }

    /*-----------------------------------------------------------------------------------------------------------------*/
    /* Interrupt make by  AF:  AF: Acknowledge failure  (Flag =  AF ,  Enable control bit = ITERREN )*/
    temp2 = I2C_GetFlagStatus(pI2CHandle->pI2Cx, I2C_SR1_AF, I2C_Check_Flag_SR1);
    if (temp1 && temp2)
    {
        /* Set by hardware when no acknowledge is returned.*/
        /*  Cleared by software writing 0, or by hardware when PE=0 */
        pI2CHandle->pI2Cx->SR1 &= ~(1U << I2C_SR1_AF);
        /*Call applicationevent to notice user already done in interrupt with I2C_EVENT_ARLO */
        I2C_ApplicationEventCallBack(pI2CHandle, I2C_EVENT_AF);
    }

    /*-----------------------------------------------------------------------------------------------------------------*/
    /* Interrupt make by  OVR:   OVR: Overrun/Underrun  (Flag =  OVR ,  Enable control bit = ITERREN )*/
    temp2 = I2C_GetFlagStatus(pI2CHandle->pI2Cx, I2C_SR1_OVR, I2C_Check_Flag_SR1);
    if (temp1 && temp2)
    {
        /* Set by hardware in slave mode when NOSTRETCH=1 and:– In reception when a new byte is received (including ACK pulse) and the DR register has not
been read yet. New received byte is lost.– In transmission when a new byte should be sent and the DR register has not been written
yet. The same byte is sent twice.*/
        /*  Cleared by software writing 0, or by hardware when PE=0 */
        pI2CHandle->pI2Cx->SR1 &= ~(1U << I2C_SR1_OVR);
        /*Call applicationevent to notice user already done in interrupt with I2C_EVENT_ARLO */
        I2C_ApplicationEventCallBack(pI2CHandle, I2C_EVENT_OVR);
    }

    /*-----------------------------------------------------------------------------------------------------------------*/
    /* Interrupt make by  TIMEOUT: Timeout or Tlow error:   (Flag =  TIMEOUT ,  Enable control bit = ITERREN )*/
    temp2 = I2C_GetFlagStatus(pI2CHandle->pI2Cx, I2C_SR1_TIMEOUT, I2C_Check_Flag_SR1);
    if (temp1 && temp2)
    {
        /*  RM page 866 */
        /*  Cleared by software writing 0, or by hardware when PE=0 */
        pI2CHandle->pI2Cx->SR1 &= ~(1U << I2C_SR1_TIMEOUT);
        /*Call applicationevent to notice user already done in interrupt with I2C_EVENT_ARLO */
        I2C_ApplicationEventCallBack(pI2CHandle, I2C_EVENT_TIMEOUT);
    }
}

void I2C_ApplicationEventCallBack(I2C_Handle_t *pI2CxHandle, uint8_t ApEvent)
{
}
